app/controllers/api/entries_controller.rb

SELECT "entries".* FROM "entries" WHERE "entries"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @entry = Entry.find_by(id: params[:id])

SELECT "entries".* FROM "entries" WHERE "entries"."feed_id" = $1  [["feed_id", 13]]
SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT 1  [["id", "13"]]
---
  def index
    # @entries = Feed.find_by(id: params[:feed_id]).latest_entries
    @entries = Feed.find_by(id: params[:feed_id]).entries