app/controllers/api/feeds_controller.rb

SELECT "feeds".* FROM "feeds" INNER JOIN "user_feeds" ON "feeds"."id" = "user_feeds"."feed_id" WHERE "user_feeds"."user_id" = $1 AND "feeds"."id" = $2 LIMIT 1  [["user_id", 7], ["id", "6"]]
---
  def show
    @feed = current_user.feeds.find_by(id: params[:id])

INSERT INTO "feeds" ("created_at", "title", "updated_at", "url") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Thu, 05 Feb 2015 01:26:11 UTC +00:00], ["title", "Slashdot"], ["updated_at", Thu, 05 Feb 2015 01:26:11 UTC +00:00], ["url", "http://slashdot.org/index.rdf"]]
SELECT "feeds".* FROM "feeds" WHERE "feeds"."url" = 'http://lorem-rss.herokuapp.com/feed' LIMIT 1
SELECT 1 AS one FROM "feeds" INNER JOIN "user_feeds" ON "feeds"."id" = "user_feeds"."feed_id" WHERE "user_feeds"."user_id" = $1 AND "feeds"."id" = 6 LIMIT 1  [["user_id", 7]]
---
  def create
    if !valid?(feed_params[:url])
      render json: {error: "Invalid URL Format."}, status: :unprocessable_entity
    else
      @feed = Feed.find_or_create(feed_params[:url])

      if (current_user.feeds.include?(@feed))

SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT 1  [["id", "13"]]
DELETE FROM "feeds" WHERE "feeds"."id" = $1  [["id", 13]]
---
  def destroy
    feed = current_user.feeds.find_by(id: params[:id])

    if (feed)
      feed.destroy