app/controllers/users_controller.rb

  def create
    if (user_params[:button])
      @user = User.find_by(user_name: "demo")
      sign_in!(@user)
      redirect_to root_url
    else
      @user = User.new(user_params)

      if @user.save
---
SELECT "users".* FROM "users" WHERE "users"."user_name" = 'demo' LIMIT 1
INSERT INTO "users" ("created_at", "email", "password_digest", "session_token", "updated_at", "user_name") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = 7  [["session_token", "ATAoyaK_74du1okVqFI-rtU_kVSAFMNTlLtJVNOHkoU"], ["updated_at", Wed, 04 Feb 2015 06:45:30 UTC +00:00]]